{"name":"i18n-gettext","title":"I18n gettext plugin for griffon","description":"Based on the grails plugin i18n-gettext by Rainer Brang, Backend-Server GmbH & Co. KG.\n    \nThis plugin adds i18n support to your app, in 'gnu gettext'-style.\n1 First, you need to wrap special tags or service calls around all strings you want to translate.\n2 Then you call \"griffon i18n-gettext\" to extract all translatable strings from your sources.\n3 Now you translate all strings from step 2 which you will find in .po files in your i18n directory.\n4 Call \"griffon i18n-gettext makemo\" to compile your translated .po files into resource classes.\n5 repeat 1-4 each time you added some new strings to your application. Existing translations will be merged in. \n\nDuring runtime: The methods, you wrapped around the strings, will pick the correct translation according to the\ncurrent locale, and return the translated string. You may also force a locale for a specific call.\n\nWhat you need: The developer needs these command line tools for the development machine: xgettext, msgmerge and msgfmt\nThe translator may like: PoEdit or alike to translate texts.\n\nYou will love the dead simple plural form handling and FormatMessage-like String handling. Additionally, you can \nforget about inventing lookup keys for your .properties files, because for gnu gettext, the original string is the key.\nPlus: No more problems with special chars like german umlauts. gettext can handle that.\n\nYou can exclude directories from being scanned for translatable strings in your Config.groovy file.\n\nBeware: \na) Gnu gettext can not handle groovy's \"here-doc\" strings, so don't try to wrap tr() or alike around them. Also some\nxgettext binaries seem to dislike here-doc strings so much, they don't parse files containing here-doc files correctly.\nb) Your original strings should be english, because Gnu gettext can't cope with non-ascii characters as original strings.\n\nMany thanks to:\nRainer Brang for his grails plugin","license":"Apache License, Version 2.0","source":"http://svn.codehaus.org/griffon/plugins/griffon-i18n-gettext","authors":[{"name":"Tobias Schulte","email":"tobias.schulte@gliderpilot.de"}],"toolkits":[],"platforms":[],"releases":[{"version":"0.2","griffonVersion":"0.9 > *","dependencies":[],"date":"2011-02-21T12:19:33+0100","type":"plugin","checksum":"10a51cdc80affd91e3a75e0b983d9f6b"},{"version":"0.1","griffonVersion":"0.9 > *","dependencies":[],"date":"2011-02-10T09:26:55+0100","type":"plugin","checksum":"f0146a53b2230eb979971b875ec0eed3"}]}